** Testing with org-babel
Evaluate all the cells in this table for a comprehensive test of the
org-babel functionality.

*Note*: if you have customized =org-babel-default-header-args= then some
of these tests may fail.

#+TBLNAME: org-babel-clojure-tests
| functionality            | block                   | arg |                          expected |                           results | pass |
|--------------------------+-------------------------+-----+-----------------------------------+-----------------------------------+------|
| basic evaluation         |                         |     |                                   |                                   | pass |
|--------------------------+-------------------------+-----+-----------------------------------+-----------------------------------+------|
| clojure                  | basic-scheme            |     |                                 5 |                                 5 | pass |
| clojure                  | hello-scheme            |     |                      hello scheme |                     hello clojure | pass |
|--------------------------+-------------------------+-----+-----------------------------------+-----------------------------------+------|
| tables                   |                         |     |                                   |                                   | pass |
|--------------------------+-------------------------+-----+-----------------------------------+-----------------------------------+------|
| clojure                  | table-scheme            |     |                                 3 |                                 3 | pass |
| clojure                  | table-scheme-join       |     |                             1-2-3 |                             1-2-3 | pass |
|--------------------------+-------------------------+-----+-----------------------------------+-----------------------------------+------|
| source block references  |                         |     |                                   |                                   | pass |
|--------------------------+-------------------------+-----+-----------------------------------+-----------------------------------+------|
| all languages            | scheme-chained-ref-last |     | class clojure.lang.PersistentList | class clojure.lang.PersistentList | pass |
|--------------------------+-------------------------+-----+-----------------------------------+-----------------------------------+------|
| source block functions   |                         |     |                                   |                                   | pass |
|--------------------------+-------------------------+-----+-----------------------------------+-----------------------------------+------|
| clojure                  | defn-fib                |     |                        #'user/fib |                        #'user/fib | pass |
| clojure arg1             | clojure-fibonacci       |   0 |                                 0 |                                 0 | pass |
| clojure arg2             | clojure-fibonacci       |   1 |                                 1 |                                 1 | pass |
| clojure arg3             | clojure-fibonacci       |   3 |                                 2 |                                 2 | pass |
|--------------------------+-------------------------+-----+-----------------------------------+-----------------------------------+------|
| sessions                 |                         |     |                                   |                                   | pass |
|--------------------------+-------------------------+-----+-----------------------------------+-----------------------------------+------|
| set ruby session         | set-python-session-var  |     |                               set |                               set | pass |
| get from ruby session    | get-python-session-var  |     |                                 4 |                                 4 | pass |
| set clojure session      | set-clojure-session-var |     |                              :set |                              :set | pass |
| get from clojure session | get-clojure-session-var |     |                                 3 |                                 3 | pass |
#+TBLFM: $5='(if (= (length $3) 1) (progn (message (format "running %S" '(sbe $2 (n $3)))) (sbe $2 (n $3))) (sbe $2))::$6='(if (string= $4 $5) "pass" (format "expected %S but was %S" $4 $5))
#+TBLFM: $5=""::$6=""

